sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/board/pin_mux.c
    PORT1->PCR[11] = ((PORT1->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_12 (pin 5) is configured as LPI2C1_SDA */
    PORT_SetPinMux(BOARD_INITPINS_I2C1_SDA_PORT, BOARD_INITPINS_I2C1_SDA_PIN, kPORT_MuxAlt2);

    PORT1->PCR[12] = ((PORT1->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_13 (pin 6) is configured as LPI2C1_SCL */
    PORT_SetPinMux(BOARD_INITPINS_I2C1_SCL_PORT, BOARD_INITPINS_I2C1_SCL_PIN, kPORT_MuxAlt2);

    PORT1->PCR[13] = ((PORT1->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_14 (pin 7) is configured as ADC1_A12 */
    PORT_SetPinMux(BOARD_INITPINS_AD14_PORT, BOARD_INITPINS_AD14_PIN, kPORT_MuxAlt0);

    PORT1->PCR[14] = ((PORT1->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_15 (pin 8) is configured as ADC1_A13 */
    PORT_SetPinMux(BOARD_INITPINS_AD13_PORT, BOARD_INITPINS_AD13_PIN, kPORT_MuxAlt0);

    PORT1->PCR[15] = ((PORT1->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_2 (pin 93) is configured as LPSPI0_SDI */
    PORT_SetPinMux(BOARD_INITPINS_SPI0_MISO_PORT, BOARD_INITPINS_SPI0_MISO_PIN, kPORT_MuxAlt2);

    PORT1->PCR[2] = ((PORT1->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_3 (pin 94) is configured as LPSPI0_PCS0 */
    PORT_SetPinMux(BOARD_INITPINS_SPI0_CS_PORT, BOARD_INITPINS_SPI0_CS_PIN, kPORT_MuxAlt2);

    PORT1->PCR[3] = ((PORT1->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_30 (pin 10) is configured as XTAL48M */
    PORT_SetPinMux(BOARD_INITPINS_OSC_OUT_PORT, BOARD_INITPINS_OSC_OUT_PIN, kPORT_MuxAlt0);

    PORT1->PCR[30] = ((PORT1->PCR[30] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_31 (pin 11) is configured as EXTAL48M */
    PORT_SetPinMux(BOARD_INITPINS_OSC_IN_PORT, BOARD_INITPINS_OSC_IN_PIN, kPORT_MuxAlt0);

    PORT1->PCR[31] = ((PORT1->PCR[31] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_4 (pin 97) is configured as ADC0_A20 */
    PORT_SetPinMux(BOARD_INITPINS_AD1_PORT, BOARD_INITPINS_AD1_PIN, kPORT_MuxAlt0);

    PORT1->PCR[4] = ((PORT1->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_5 (pin 98) is configured as ADC0_A21 */
    PORT_SetPinMux(BOARD_INITPINS_AD2_PORT, BOARD_INITPINS_AD2_PIN, kPORT_MuxAlt0);

    PORT1->PCR[5] = ((PORT1->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_6 (pin 99) is configured as ADC0_A22 */
    PORT_SetPinMux(BOARD_INITPINS_AD3_PORT, BOARD_INITPINS_AD3_PIN, kPORT_MuxAlt0);

    PORT1->PCR[6] = ((PORT1->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_7 (pin 100) is configured as ADC0_A23 */
    PORT_SetPinMux(BOARD_INITPINS_AD4_PORT, BOARD_INITPINS_AD4_PIN, kPORT_MuxAlt0);

    PORT1->PCR[7] = ((PORT1->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_8 (pin 1) is configured as P1_8 */
    PORT_SetPinMux(BOARD_INITPINS_LED_PORT, BOARD_INITPINS_LED_PIN, kPORT_MuxAlt0);

    PORT1->PCR[8] = ((PORT1->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_0 (pin 22) is configured as ADC0_A0 */
    PORT_SetPinMux(BOARD_INITPINS_AD6_PORT, BOARD_INITPINS_AD6_PIN, kPORT_MuxAlt0);

    PORT2->PCR[0] = ((PORT2->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT2_1 (pin 23) is configured as ADC1_A0 */
    PORT_SetPinMux(BOARD_INITPINS_AD7_PORT, BOARD_INITPINS_AD7_PIN, kPORT_MuxAlt0);

    PORT2->PCR[1] = ((PORT2->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT2_12 (pin 34) is configured as LPSPI1_SCK */
    PORT_SetPinMux(BOARD_INITPINS_SPI1_SCK_PORT, BOARD_INITPINS_SPI1_SCK_PIN, kPORT_MuxAlt2);

