sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/board/pin_mux.c
    gpio_pin_config_t IO7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO2_20 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_IO7_GPIO, BOARD_INITPINS_IO7_PIN, &IO7_config);

    gpio_pin_config_t ADC_PWR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO2_21 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_ADC_PWR_GPIO, BOARD_INITPINS_ADC_PWR_PIN, &ADC_PWR_config);

    gpio_pin_config_t IN4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_23 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_IN4_GPIO, BOARD_INITPINS_IN4_PIN, &IN4_config);

    gpio_pin_config_t RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_11 (pin 66)  */
    GPIO_PinInit(BOARD_INITPINS_RESET_GPIO, BOARD_INITPINS_RESET_PIN, &RESET_config);

    gpio_pin_config_t LED_OUT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_12 (pin 63)  */
    GPIO_PinInit(BOARD_INITPINS_LED_OUT_GPIO, BOARD_INITPINS_LED_OUT_PIN, &LED_OUT_config);

    gpio_pin_config_t IO2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_IO2_GPIO, BOARD_INITPINS_IO2_PIN, &IO2_config);

    gpio_pin_config_t RS485_EN2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_16 (pin 59)  */
    GPIO_PinInit(BOARD_INITPINS_RS485_EN2_GPIO, BOARD_INITPINS_RS485_EN2_PIN, &RS485_EN2_config);

    gpio_pin_config_t IN5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_17 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_IN5_GPIO, BOARD_INITPINS_IN5_PIN, &IN5_config);

    gpio_pin_config_t IN1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_18 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_IN1_GPIO, BOARD_INITPINS_IN1_PIN, &IN1_config);

    gpio_pin_config_t IN10_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_19 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_IN10_GPIO, BOARD_INITPINS_IN10_PIN, &IN10_config);

    gpio_pin_config_t IN6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_20 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_IN6_GPIO, BOARD_INITPINS_IN6_PIN, &IN6_config);

    gpio_pin_config_t IN7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_21 (pin 54)  */
    GPIO_PinInit(BOARD_INITPINS_IN7_GPIO, BOARD_INITPINS_IN7_PIN, &IN7_config);

    gpio_pin_config_t I2C3_WP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_22 (pin 53)  */
    GPIO_PinInit(BOARD_INITPINS_I2C3_WP_GPIO, BOARD_INITPINS_I2C3_WP_PIN, &I2C3_WP_config);

    gpio_pin_config_t IO3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_29 (pin 50)  */
    GPIO_PinInit(BOARD_INITPINS_IO3_GPIO, BOARD_INITPINS_IO3_PIN, &IO3_config);

    gpio_pin_config_t IO1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_30 (pin 49)  */
    GPIO_PinInit(BOARD_INITPINS_IO1_GPIO, BOARD_INITPINS_IO1_PIN, &IO1_config);

    /* Interrupt configuration on GPIO2_23 (pin 42): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_IN4_GPIO, BOARD_INITPINS_IN4_PIN, kGPIO_InterruptStatusFlagDisabled);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
